# **Criando um DataFrame**

In [2]:
import pandas as pd

## Criando um DaraFrame a partir de uma lista de tuplas

In [3]:
idade_alunos = [19,20,21,22]
nomes_alunos = ["Sandro ", "Laura", "Bruno", "Suzana"]

bd = list(zip(nomes_alunos, idade_alunos))
display(bd)

dt = pd.DataFrame(bd, columns = ["Nome", "Idade"])
display(dt)

[('Sandro ', 19), ('Laura', 20), ('Bruno', 21), ('Suzana', 22)]

      Nome  Idade
0  Sandro      19
1    Laura     20
2    Bruno     21
3   Suzana     22

# Criando DataFrame a partir dos dicionário

In [4]:
Alunos = {
    "Nomes": ["Alvaro", "Carlos", "Creuza"],
    "Idades": [21,22,26]
}

DB_Alunos = pd.DataFrame(Alunos)
DB_Alunos

    Nomes  Idades
0  Alvaro      21
1  Carlos      22
2  Creuza      26

# Criando um DataFrame com Rótulos Personalizados

In [10]:
dados = [("Ana", 32), ("Sandra", 22), ("Bruna", 34)]
linhas = ["A", "B", "C"]
colunas = ["Names", "Ages"]

info_alunos = pd.DataFrame(dados, columns = colunas, index = linhas)
info_alunos

    Names  Ages
A     Ana    32
B  Sandra    22
C   Bruna    34

# Modificando os Rótulos de uma DataFrame

In [11]:
dados = [("Ana", 32), ("Sandra", 22), ("Bruna", 34)]
info_alunos2 = pd.DataFrame(dados)
info_alunos2

        0   1
0     Ana  32
1  Sandra  22
2   Bruna  34

In [ ]:
# Modificando rotulos para a coluna
info_alunos2.columns = ["Names", "Ages"]
info_alunos2

    Names  Ages
0     Ana    32
1  Sandra    22
2   Bruna    34

In [13]:
# Modificando rotulos para a linha
info_alunos2.index = ["A", "B", "C"]
info_alunos2

    Names  Ages
A     Ana    32
B  Sandra    22
C   Bruna    34

# Atributos de um DataFrame
* index
* columns
* ndim
* shape
* size
* empty

### **index :** Retrorna rotulos das linhas em formato de lista, ou seja, retornam os ids das linhas em formato de lista

In [14]:
info_alunos.index

Index(['A', 'B', 'C'], dtype='object')

### **columns:** retorna os rotulos das colunas em formato de lista, ou seja, info das colunas em formato de lista.

In [16]:
print(info_alunos.columns)

Index(['Names', 'Ages'], dtype='object')

### **ndim:** retorna o número de dimensões do DataFrame.

In [18]:
print(f"Esse DataFrame tem: {info_alunos.ndim} dimensões")

Esse DataFrame tem: 2 dimensões

### **shape:** retorna o tamanho de cada uma das dimensões em um formato de tupla.

In [19]:
info_alunos.shape

(3, 2)

### **size:** retorna o número de elementos (células) do DataFrame.

In [21]:
info_alunos.size

6

### **empty:** retorna se o DataFrame está vazio (True) ou não (False).

In [22]:
info_alunos.empty

False